
#Область ПрограммныйИнтерфейс

// БоклачПИ 29.05.2026 Если вид договоров – абоненское обслуживание, то выведем на форму
// новые реквизиты договора (ВКМ_ДатаНачалаДействияДоговора, ВКМ_ДатаОкончанияДействияДоговора,
// ВКМ_СуммаЕжемесячнойАбоненсткойПлаты, ВКМ_СтоимостьЧасаРаботыСпециалиста)
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если  ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
	
КонецПроцедуры // Конец.Боклач 29.05.2026

#КонецОбласти
