
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	
	АбоненскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание");
	
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = АбоненскоеОбслуживание;
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = АбоненскоеОбслуживание;
	Элементы.ВКМ_СуммаЕжемесячнойАбоненсткойПлаты.Видимость = АбоненскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость = АбоненскоеОбслуживание;
	
КонецПроцедуры

#КонецОбласти